{
  "city": "detroit",
  "edge_types": {
    "META": {
      "label": "Creator → Creation",
      "color": "#d4af37"
    },
    "P2C": {
      "label": "Person → Creation",
      "color": "#dc3545"
    },
    "C2C": {
      "label": "Creator ↔ Creator",
      "color": "#50c878"
    },
    "ORG": {
      "label": "Organizational / Ideological",
      "color": "#3388ff"
    }
  },
  "evidence_tiers": {
    "1": {
      "label": "Documented",
      "line_style": "solid",
      "opacity": 0.9
    },
    "2": {
      "label": "Evidenced (unverified)",
      "line_style": "dashed",
      "opacity": 0.6
    },
    "3": {
      "label": "Interpretive",
      "line_style": "dotted",
      "opacity": 0.35
    }
  },
  "figures": [
    {
      "id": "goines_donald",
      "name": "Donald Goines",
      "type": "real",
      "meta_badman": true,
      "modality": "detective",
      "years": {
        "birth": 1936,
        "death": 1974,
        "active_start": 1970,
        "active_end": 1974
      },
      "emergence": {
        "year": 1955,
        "context": "Returned from Korea with heroin addiction at age 19, began criminal career that would result in seven prison sentences for robbery, theft, and drug-related offenses.",
        "source": {
          "title": "Low Road: The Life and Legacy of Donald Goines",
          "url": "https://www.goodreads.com/book/show/115048.Low_Road"
        }
      },
      "scores": {
        "outlaw_relationship": {
          "score": 5,
          "justification": "Seven prison sentences for robbery, theft, and drug-related offenses. Never sought legitimacy within legal systems. Career criminal from age 15 until death."
        },
        "community_authorization": {
          "score": 5,
          "justification": "Novels achieved massive circulation in Black communities through barbershops, beauty salons, and street vendors. Holloway House reported millions of copies sold. Recognized as authentic voice of street life."
        },
        "violence_as_language": {
          "score": 5,
          "justification": "Both lived and wrote violence as primary mode of expression. Characters resolve conflicts through physical confrontation. His own death—murdered alongside his partner—embodied this principle."
        },
        "cultural_preservation": {
          "score": 5,
          "justification": "Documented Black urban street life with ethnographic detail. Preserved vernacular, survival strategies, and community dynamics that official records ignored. Created literary archive of underclass experience."
        },
        "hypermasculine_performance": {
          "score": 5,
          "justification": "Embodied and narrated Black masculine bravado, sexual prowess, and physical dominance. Characters perform masculinity through control of territory, women, and rival men."
        }
      },
      "influence": {
        "scale": "1-10",
        "metric_type": "curated_scholarly_estimate",
        "phases": [
          {
            "start": 1970,
            "end": 1974,
            "value": 8,
            "justification": "Published 16 novels in approximately 5 years through Holloway House. Established street literature as a recognizable genre. Readership concentrated in Black urban communities.",
            "source": "Bryant, Born in a Mighty Bad Land, pp. 112-118"
          },
          {
            "start": 1975,
            "end": 1989,
            "value": 6,
            "justification": "Posthumous reprints sustained cultural presence. Holloway House continued publishing. No mainstream critical attention but consistent community readership.",
            "source": "TBD — needs archival verification"
          },
          {
            "start": 1990,
            "end": 2010,
            "value": 7,
            "justification": "Hip-hop culture increasingly references Goines. Multiple artists cite his work as influence. Biography attempts and renewed scholarly interest.",
            "source": "TBD — needs specific citation data"
          },
          {
            "start": 2011,
            "end": 2025,
            "value": 5,
            "justification": "Legacy stable but not growing. Street literature genre well-established. Goines recognized as progenitor but less actively cited.",
            "source": "TBD — scholarly estimate"
          }
        ]
      },
      "biography": {
        "description": "Donald Goines represents the apex of the meta-badman: a career criminal who documented street life while living it. Born in Detroit to middle-class parents, Goines rejected conventional paths, falsifying his age to join the Air Force at 15 and returning with a heroin addiction that would define his life. He cycled through Michigan's prison system seven times, teaching himself to write during his incarcerations. Between 1969 and 1974, Goines produced sixteen novels that sold millions of copies, primarily through informal distribution networks in Black communities. His work captured the texture of urban survival—the hustles, the addictions, the violence, the codes of honor among outlaws. On October 21, 1974, Goines and his partner Shirley Sailor were murdered in their Highland Park home, a crime that remains unsolved. Theories suggest his killers may have been figures from the life he documented, making his death the final chapter of the story he spent his career telling.",
        "key_events": [
          {
            "year": 1952,
            "event": "Falsified age to join U.S. Air Force at 15",
            "location": "Detroit, MI"
          },
          {
            "year": 1955,
            "event": "Returned from Korea with heroin addiction, began criminal career",
            "location": "Detroit, MI"
          },
          {
            "year": 1969,
            "event": "Wrote first novel Dopefiend while incarcerated",
            "location": "Jackson State Prison, MI"
          },
          {
            "year": 1971,
            "event": "Dopefiend published by Holloway House",
            "location": "Los Angeles, CA"
          },
          {
            "year": 1974,
            "event": "Published Crime Partners, first Kenyatta novel, under pseudonym Al C. Clark",
            "location": "Los Angeles, CA"
          },
          {
            "year": 1974,
            "event": "Murdered alongside Shirley Sailor in Highland Park home",
            "location": "Highland Park, MI"
          }
        ]
      },
      "geographic": {
        "primary_location": {
          "name": "Black Bottom",
          "coordinates": {
            "lat": 42.3355,
            "lng": -83.037
          }
        },
        "territory": {
          "description": "Goines operated primarily in Black Bottom and the surrounding East Side of Detroit, with significant presence in Highland Park where he lived and died. His territory spanned the traditional Black neighborhoods along Hastings Street before urban renewal destroyed the community, and later the areas around Highland Park that absorbed displaced residents.",
          "polygon": [
            [
              42.345,
              -83.055
            ],
            [
              42.345,
              -83.025
            ],
            [
              42.32,
              -83.025
            ],
            [
              42.32,
              -83.055
            ]
          ]
        },
        "additional_locations": [
          {
            "name": "Highland Park residence (murder site)",
            "coordinates": {
              "lat": 42.4056,
              "lng": -83.0977
            },
            "significance": "Site of Goines's murder alongside Shirley Sailor, October 21, 1974"
          },
          {
            "name": "Jackson State Prison",
            "coordinates": {
              "lat": 42.2459,
              "lng": -84.4013
            },
            "significance": "Where Goines wrote Dopefiend and multiple other novels during incarceration"
          }
        ]
      },
      "connections": [
        {
          "target_id": "kenyatta",
          "type": "META",
          "direction": "outgoing",
          "tier": 1,
          "start_year": 1974,
          "end_year": 1975,
          "evidence": "Goines created Kenyatta under pseudonym Al C. Clark, publishing four novels (Crime Partners, Death List, Kenyatta's Escape, Kenyatta's Last Hit) between 1974-1975.",
          "source": "Holloway House publication records; novels carry Al C. Clark pseudonym"
        }
      ],
      "sources": {
        "primary": [
          {
            "title": "Dopefiend",
            "type": "novel",
            "year": 1971,
            "url": "https://www.kensingtonbooks.com/9781496733290/dopefiend/"
          },
          {
            "title": "Crime Partners (Kenyatta Series #1)",
            "type": "novel",
            "year": 1974,
            "url": "https://www.kensingtonbooks.com/9781496733283/crime-partners/"
          },
          {
            "title": "Never Die Alone",
            "type": "novel",
            "year": 1974,
            "url": "https://www.kensingtonbooks.com/9781496733269/never-die-alone/"
          }
        ],
        "secondary": [
          {
            "title": "Low Road: The Life and Legacy of Donald Goines",
            "type": "biography",
            "year": 2004,
            "url": "https://www.goodreads.com/book/show/115048.Low_Road"
          },
          {
            "title": "Born in a Mighty Bad Land: The Violent Man in African American Folklore and Fiction",
            "type": "academic",
            "year": 2003,
            "url": "https://iupress.org/9780253215789/born-in-a-mighty-bad-land/"
          }
        ],
        "archival": [
          {
            "title": "Holloway House Publishing records",
            "type": "publisher",
            "repository": "Unknown - company defunct",
            "url": null,
            "notes": "Primary source for sales data; Holloway House was notoriously opaque about figures. Company no longer exists; records may be lost."
          }
        ]
      }
    },
    {
      "id": "kenyatta",
      "name": "Kenyatta",
      "type": "fictional",
      "meta_badman": false,
      "modality": "detective",
      "medium": "print",
      "creator_id": "goines_donald",
      "years": {
        "active_start": 1974,
        "active_end": 1975
      },
      "emergence": {
        "year": 1974,
        "context": "First appearance in Crime Partners, published by Holloway House under Goines's pseudonym Al C. Clark. Introduced as leader of a paramilitary organization waging war against drug dealers and racist police in Detroit.",
        "source": {
          "title": "Crime Partners",
          "url": "https://www.kensingtonbooks.com/9781496733283/crime-partners/"
        }
      },
      "scores": {
        "outlaw_relationship": {
          "score": 5,
          "justification": "Operates entirely outside legal systems as leader of a paramilitary organization. Wages war against both drug dealers and racist police. No pretense of legitimacy within state structures."
        },
        "community_authorization": {
          "score": 5,
          "justification": "Commands an army of community members who follow him willingly. His mission—ridding the ghetto of drugs and corrupt cops—directly serves community interests. Named after Jomo Kenyatta, father of Kenyan independence."
        },
        "violence_as_language": {
          "score": 5,
          "justification": "Violence is his primary mode of operation. Organizes assassinations, armed raids, and paramilitary strikes. The novels are structured around escalating violent confrontations."
        },
        "cultural_preservation": {
          "score": 4,
          "justification": "Represents the revolutionary aspirations of the Black Power era. Preserves and transmits ideology of armed self-defense and community control. However, his fictional status limits direct community engagement."
        },
        "hypermasculine_performance": {
          "score": 3,
          "justification": "Commands respect through tactical brilliance and organizational leadership more than personal physical dominance. Masculinity expressed through control of territory and people rather than individual combat."
        }
      },
      "influence": {
        "scale": "1-10",
        "metric_type": "curated_scholarly_estimate",
        "_REVIEW_NEEDED": "HARRY — these are placeholder estimates. Review and revise all values.",
        "phases": [
          {
            "start": 1974,
            "end": 1975,
            "value": 5,
            "justification": "PLACEHOLDER — Four novels published in rapid succession. Readership tied to Goines's existing audience. Character represents Goines's revolutionary vision but published under pseudonym, limiting initial recognition.",
            "source": "TBD"
          },
          {
            "start": 1976,
            "end": 1999,
            "value": 3,
            "justification": "PLACEHOLDER — Novels remain in print through Holloway House reprints. Cultural presence sustained by association with Goines but Kenyatta not independently cited as a cultural figure. No adaptations.",
            "source": "TBD"
          },
          {
            "start": 2000,
            "end": 2025,
            "value": 2,
            "justification": "PLACEHOLDER — Goines's broader catalog overshadows the Kenyatta series. Novels available but not actively driving cultural conversation. Scholarly interest in Goines rarely centers the Kenyatta character specifically.",
            "source": "TBD"
          }
        ]
      },
      "biography": {
        "description": "Kenyatta is the protagonist of Donald Goines's four-novel series published under the pseudonym Al C. Clark. Named after Jomo Kenyatta, the father of Kenyan independence, he leads a militant organization of Black men and women dedicated to cleansing Detroit's ghettos of drug dealers and racist police officers. Operating from a fortified farm outside the city where he trains his soldiers, Kenyatta wages a systematic war against the forces destroying his community. The series follows his escalating conflict with both the criminal underworld and law enforcement, culminating in a cross-country chase that ends in Las Vegas. Kenyatta represents Goines's vision of what organized Black resistance might look like—a disciplined, armed, community-authorized force operating outside the law to protect those the law refuses to serve.",
        "key_events": [
          {
            "year": 1974,
            "event": "First appearance in Crime Partners, introduced as leader of militant Black organization",
            "location": "Detroit, MI (fictional)"
          },
          {
            "year": 1974,
            "event": "Death List published, following Kenyatta's systematic elimination of drug suppliers",
            "location": "Detroit, MI (fictional)"
          },
          {
            "year": 1974,
            "event": "Kenyatta's Escape published, depicting hijacking and cross-country flight",
            "location": "Nevada/Los Angeles (fictional)"
          },
          {
            "year": 1975,
            "event": "Kenyatta's Last Hit published posthumously, concluding series in Las Vegas showdown",
            "location": "Las Vegas, NV (fictional)"
          }
        ],
        "creator": "Donald Goines (as Al C. Clark)",
        "source_text": "Crime Partners (1974)"
      },
      "geographic": {
        "primary_location": {
          "name": "Detroit (fictional)",
          "coordinates": {
            "lat": 42.332,
            "lng": -83.0458
          }
        },
        "territory": {
          "description": "Kenyatta operates from a fortified training farm outside Detroit while conducting operations throughout the city's Black neighborhoods. His territory extends wherever drug dealers and corrupt police operate, making the entire ghetto his zone of operation. The series eventually expands his territory westward through Nevada to Los Angeles as he flees law enforcement.",
          "polygon": [
            [
              42.4,
              -83.1
            ],
            [
              42.4,
              -82.95
            ],
            [
              42.3,
              -82.95
            ],
            [
              42.3,
              -83.1
            ]
          ]
        },
        "additional_locations": [
          {
            "name": "Training farm (fictional)",
            "coordinates": {
              "lat": 42.5,
              "lng": -83.2
            },
            "significance": "Fortified compound outside Detroit where Kenyatta trains his paramilitary organization"
          }
        ]
      },
      "connections": [],
      "sources": {
        "primary": [
          {
            "title": "Crime Partners",
            "type": "novel",
            "year": 1974,
            "url": "https://www.kensingtonbooks.com/9781496733283/crime-partners/"
          },
          {
            "title": "Death List",
            "type": "novel",
            "year": 1974,
            "url": "https://www.kensingtonbooks.com/9781496735966/death-list/"
          },
          {
            "title": "Kenyatta's Escape",
            "type": "novel",
            "year": 1974,
            "url": "https://www.kensingtonbooks.com/9781496739377/kenyattas-escape/"
          },
          {
            "title": "Kenyatta's Last Hit",
            "type": "novel",
            "year": 1975,
            "url": "https://www.kensingtonbooks.com/9781496742988/kenyattas-last-hit/"
          }
        ],
        "secondary": [
          {
            "title": "Low Road: The Life and Legacy of Donald Goines",
            "type": "biography",
            "year": 2004,
            "url": "https://www.goodreads.com/book/show/115048.Low_Road"
          }
        ],
        "archival": []
      }
    },
    {
      "id": "action_jackson",
      "name": "Jericho 'Action' Jackson",
      "type": "fictional",
      "meta_badman": false,
      "modality": "detective",
      "medium": "film",
      "creator_id": null,
      "years": {
        "active_start": 1988,
        "active_end": 1988
      },
      "emergence": {
        "year": 1988,
        "context": "Film released February 12, 1988. Character originated from Carl Weathers's conversation with Predator producer Joel Silver about their shared love of Shaft and 1970s blaxploitation cinema. Weathers developed the concept; Robert Reneau wrote the screenplay.",
        "source": {
          "title": "Action Jackson",
          "url": "https://www.imdb.com/title/tt0094612/"
        }
      },
      "scores": {
        "outlaw_relationship": {
          "score": 4,
          "justification": "Operates within legal system as Detroit police sergeant but was demoted for excessive force. Goes fully vigilante after being framed for murder, operating outside law to clear his name and bring down Dellaplane."
        },
        "community_authorization": {
          "score": 4,
          "justification": "Protects auto workers union members against corporate assassination. Partners with Sydney Ash, representing protection of vulnerable community members. However, his authorization comes more from institutional badge than grassroots community."
        },
        "violence_as_language": {
          "score": 5,
          "justification": "Violence defines his character from opening scene. Demoted for nearly tearing off a man's arm. The film is structured around escalating physical confrontations, car chases, explosions, and hand-to-hand combat."
        },
        "cultural_preservation": {
          "score": 3,
          "justification": "Preserves and updates blaxploitation tradition for 1980s audiences. Carl Weathers explicitly conceived the character from his love of 1970s blaxploitation films. However, the film prioritizes action spectacle over cultural commentary."
        },
        "hypermasculine_performance": {
          "score": 5,
          "justification": "Peak hypermasculinity: Harvard-educated but physically dominant, witty but brutal. Carl Weathers's physique is central to the character. Reputation precedes him—criminals faint at the mention of his name."
        }
      },
      "influence": {
        "scale": "1-10",
        "metric_type": "curated_scholarly_estimate",
        "_REVIEW_NEEDED": "HARRY — these are placeholder estimates. Review and revise all values.",
        "phases": [
          {
            "start": 1988,
            "end": 1992,
            "value": 4,
            "justification": "PLACEHOLDER — $20.28M domestic box office on $7M budget. Commercially successful but critically dismissed. Immediate cultural impact through theatrical run and VHS distribution. Became a cable television staple.",
            "source": "Box Office Mojo"
          },
          {
            "start": 1993,
            "end": 2010,
            "value": 2,
            "justification": "PLACEHOLDER — Film fades from active cultural conversation. Cult following sustained through cable reruns and home video. Not cited in scholarly or critical discourse on Black action cinema.",
            "source": "TBD"
          },
          {
            "start": 2011,
            "end": 2025,
            "value": 2,
            "justification": "PLACEHOLDER — Nostalgic rediscovery through streaming platforms and social media. Minor cult status but not a significant cultural force. Occasionally referenced in discussions of 1980s Black action cinema.",
            "source": "TBD"
          }
        ]
      },
      "biography": {
        "description": "Jericho 'Action' Jackson is a Detroit Police Department sergeant who combines Ivy League education with street-level brutality. A Harvard Law graduate, Jackson was demoted from lieutenant after nearly tearing the arm off of Sean Dellaplane, son of powerful auto industry magnate Peter Dellaplane. When Dellaplane Sr. begins systematically murdering union officials to consolidate political power, Jackson investigates—only to be framed for the murder of Dellaplane's wife. Going vigilante with the help of Sydney Ash, a nightclub singer Dellaplane has addicted to heroin, Jackson wages a one-man war against the industrial conspiracy. The character emerged from Carl Weathers's conversations with producer Joel Silver about their shared love of 1970s blaxploitation films, updating that tradition for Reagan-era action cinema.",
        "key_events": [
          {
            "year": 1988,
            "event": "Film released February 12, 1988 by Lorimar Film Entertainment",
            "location": "Detroit, MI (setting)"
          },
          {
            "year": 1988,
            "event": "Jackson demoted from lieutenant for excessive force against Sean Dellaplane",
            "location": "Detroit, MI (fictional)"
          },
          {
            "year": 1988,
            "event": "Framed for murder of Patrice Dellaplane, goes vigilante",
            "location": "Detroit, MI (fictional)"
          },
          {
            "year": 1988,
            "event": "Final confrontation with Peter Dellaplane",
            "location": "Detroit, MI (fictional)"
          }
        ],
        "creator": "Carl Weathers (story), Robert Reneau (screenplay)",
        "source_text": "Action Jackson (1988 film)"
      },
      "geographic": {
        "primary_location": {
          "name": "Detroit (fictional)",
          "coordinates": {
            "lat": 42.3314,
            "lng": -83.0458
          }
        },
        "territory": {
          "description": "Jackson operates throughout Detroit's industrial landscape, from auto plants to executive offices to nightclubs. His territory encompasses both the working-class union halls and the elite spaces where Dellaplane's conspiracy unfolds. Though filmed primarily in Los Angeles, the film establishes Detroit's auto industry as central to its setting.",
          "polygon": [
            [
              42.38,
              -83.12
            ],
            [
              42.38,
              -83
            ],
            [
              42.28,
              -83
            ],
            [
              42.28,
              -83.12
            ]
          ]
        },
        "additional_locations": []
      },
      "connections": [],
      "sources": {
        "primary": [
          {
            "title": "Action Jackson",
            "type": "film",
            "year": 1988,
            "url": "https://www.imdb.com/title/tt0094612/"
          }
        ],
        "secondary": [
          {
            "title": "Born in a Mighty Bad Land: The Violent Man in African American Folklore and Fiction",
            "type": "academic",
            "year": 2003,
            "url": "https://iupress.org/9780253215789/born-in-a-mighty-bad-land/"
          }
        ],
        "archival": []
      }
    },
    {
      "id": "scott_ron",
      "name": "Ron Scott",
      "type": "real",
      "meta_badman": false,
      "modality": "revolutionary",
      "years": {
        "birth": 1947,
        "death": 2015,
        "active_start": 1968,
        "active_end": 2015
      },
      "emergence": {
        "year": 1968,
        "context": "Co-founded Detroit chapter of Black Panther Party after hearing Kathleen Cleaver speak at St. Matthew/St. Joseph Church. Joined Eric Bell, Jackie Spicer, George Gillis, and Victor Stewart as founding members of an organization explicitly positioned outside and against state authority.",
        "source": {
          "title": "The Rise and Fall of Detroit's Dynamic Black Panther Party",
          "url": "https://michiganchronicle.com/the-rise-and-fall-of-detroits-dynamic-black-panther-party/"
        }
      },
      "scores": {
        "outlaw_relationship": {
          "score": 5,
          "justification": "Co-founded Detroit's Black Panther Party, an organization explicitly positioned outside and against state authority. Subject of FBI COINTELPRO surveillance and suppression. Organized armed resistance to police brutality."
        },
        "community_authorization": {
          "score": 5,
          "justification": "Lifelong community organizer. Founded Peace Zones for Life to address community violence. Spokesperson for Detroit Coalition Against Police Brutality. Received Congressional Black Caucus Unsung Hero award and National Academy of Television Arts Silver Circle Award."
        },
        "violence_as_language": {
          "score": 4,
          "justification": "Armed self-defense was central to Panther ideology. However, Scott's later work emphasized de-escalation and peace-building, representing evolution from violent resistance to community reconciliation."
        },
        "cultural_preservation": {
          "score": 5,
          "justification": "Preserved and transmitted Black radical tradition through decades of organizing, media work, and mentorship. Hosted 'For My People' on Detroit PBS affiliate. Participated in Detroit Black Journal. Educated new generations about Panther legacy."
        },
        "hypermasculine_performance": {
          "score": 4,
          "justification": "Embodied revolutionary Black masculinity as Panther leader. Public speaker and confrontational presence at police commission meetings. However, later work emphasized community healing over masculine dominance."
        }
      },
      "influence": {
        "scale": "1-10",
        "metric_type": "curated_scholarly_estimate",
        "_REVIEW_NEEDED": "HARRY — these are placeholder estimates. Review and revise all values.",
        "phases": [
          {
            "start": 1968,
            "end": 1975,
            "value": 7,
            "justification": "PLACEHOLDER — Co-founded Detroit BPP chapter. Active during peak Black Panther organizing. Subject of COINTELPRO surveillance. Survived 'Detroit 15' incident (1970 armed siege). High local visibility as Panther leader.",
            "source": "TBD — Michigan Chronicle coverage; COINTELPRO files"
          },
          {
            "start": 1976,
            "end": 1995,
            "value": 4,
            "justification": "PLACEHOLDER — Post-Panther transition period. Shifted from revolutionary organizing to community-based advocacy. Lower public profile but sustained grassroots presence. Exact activities during this period need archival verification.",
            "source": "TBD — needs archival research"
          },
          {
            "start": 1996,
            "end": 2010,
            "value": 6,
            "justification": "PLACEHOLDER — Founded Peace Zones for Life. Became spokesperson for Detroit Coalition Against Police Brutality. Hosted 'For My People' on PBS affiliate. Renewed public visibility as elder activist and media figure. Spoke at 2010 Allied Media Conference.",
            "source": "TBD — ACLU Michigan; Allied Media Conference records"
          },
          {
            "start": 2011,
            "end": 2025,
            "value": 4,
            "justification": "PLACEHOLDER — Continued organizing until death in 2015. Posthumous legacy sustained through community memory and tribute coverage. Not widely known outside Detroit activist circles.",
            "source": "TBD — obituary coverage research"
          }
        ]
      },
      "biography": {
        "description": "Ron Scott grew up in Detroit's Jeffries Projects, where his politically astute single mother shaped his worldview. Accepted to the University of Michigan in 1965 before affirmative action, Scott's trajectory shifted after hearing Kathleen Cleaver speak at St. Matthew/St. Joseph Church, leading him to co-found Detroit's Black Panther Party chapter in 1968. For nearly five decades, Scott remained on the front lines of Detroit's struggle for justice—from Panther organizing to police accountability advocacy to community peace-building. As spokesperson for the Detroit Coalition Against Police Brutality and founder of Peace Zones for Life, Scott evolved from revolutionary militant to 'Transformational Anthropologist,' as he called himself, dedicated to changing human behavior toward peace and reconciliation. He died of cancer on November 29, 2015, working until his final days.",
        "key_events": [
          {
            "year": 1963,
            "event": "Participated in Detroit March where Dr. Martin Luther King Jr. delivered early version of 'I Have a Dream' speech",
            "location": "Detroit, MI"
          },
          {
            "year": 1965,
            "event": "Accepted to University of Michigan before affirmative action policies",
            "location": "Ann Arbor, MI"
          },
          {
            "year": 1968,
            "event": "Co-founded Detroit chapter of Black Panther Party after hearing Kathleen Cleaver speak",
            "location": "Detroit, MI"
          },
          {
            "year": 1968,
            "event": "Detroit Black Panther Party chapter established with Eric Bell, Jackie Spicer, George Gillis, and Victor Stewart",
            "location": "Detroit, MI"
          },
          {
            "year": 2010,
            "event": "Spoke at Allied Media Conference presenting Peace Zones for Life vision",
            "location": "Detroit, MI"
          },
          {
            "year": 2015,
            "event": "Died November 29 after battle with cancer, working until final days",
            "location": "Detroit, MI"
          }
        ]
      },
      "geographic": {
        "primary_location": {
          "name": "Jeffries Projects",
          "coordinates": {
            "lat": 42.3361,
            "lng": -83.0719
          }
        },
        "territory": {
          "description": "Scott's territory encompassed Detroit's Black neighborhoods from his childhood in Jeffries Projects through decades of organizing. His work with Peace Zones for Life focused on specific neighborhoods plagued by violence, while his advocacy reached citywide through police commission meetings and media appearances. St. Matthew/St. Joseph Church, where he first encountered Kathleen Cleaver, marked a key location in his political awakening.",
          "polygon": [
            [
              42.36,
              -83.1
            ],
            [
              42.36,
              -83.04
            ],
            [
              42.31,
              -83.04
            ],
            [
              42.31,
              -83.1
            ]
          ]
        },
        "additional_locations": [
          {
            "name": "St. Matthew/St. Joseph Church",
            "coordinates": {
              "lat": 42.352,
              "lng": -83.065
            },
            "significance": "Where Scott heard Kathleen Cleaver speak, catalyzing his decision to co-found Detroit BPP"
          },
          {
            "name": "University of Michigan",
            "coordinates": {
              "lat": 42.278,
              "lng": -83.7382
            },
            "significance": "Accepted before affirmative action policies in 1965"
          }
        ]
      },
      "connections": [
        {
          "target_id": "kenyatta",
          "type": "P2C",
          "direction": "outgoing",
          "tier": 3,
          "start_year": 1968,
          "end_year": 1975,
          "evidence": "Scott's real-world Panther organizing provided the template for Goines's fictional Kenyatta—a disciplined, armed organization defending Black communities against drugs and police violence. Both emerged in Detroit in the same era with parallel missions.",
          "source": "Scholarly interpretation — no documented link between Scott and Goines"
        },
        {
          "target_id": "baker_gordon",
          "type": "ORG",
          "direction": "mutual",
          "tier": 2,
          "start_year": 1968,
          "end_year": 2014,
          "evidence": "Revolutionary contemporaries in late 1960s Detroit, representing parallel streams of Black radical organizing—Scott through the Panthers, Baker through labor organizing. Both spoke together at 2010 U.S. Social Forum panel on their experiences.",
          "source": "2010 U.S. Social Forum panel documentation; exact origins of relationship pending Reuther Library verification"
        }
      ],
      "sources": {
        "primary": [
          {
            "title": "Ron Scott personal webpage",
            "type": "website",
            "year": null,
            "url": "https://about.me/ronscott"
          },
          {
            "title": "Allied Media Conference 2010 Video",
            "type": "video",
            "year": 2010,
            "url": "https://alliedmedia.org/news/remembering-ron-scott-watch-video-amc2010"
          }
        ],
        "secondary": [
          {
            "title": "The Legacy of Detroit Activist Ron Scott",
            "type": "news",
            "year": 2015,
            "url": "https://www.aclumich.org/en/news/legacy-detroit-activist-ron-scott"
          },
          {
            "title": "The Rise and Fall of Detroit's Dynamic Black Panther Party",
            "type": "news",
            "year": null,
            "url": "https://michiganchronicle.com/the-rise-and-fall-of-detroits-dynamic-black-panther-party/"
          }
        ],
        "archival": [
          {
            "title": "COINTELPRO Files - Detroit Field Office",
            "type": "government",
            "repository": "National Archives",
            "url": null,
            "notes": "FBI surveillance records on Detroit Black Panther Party. Requires in-person visit or FOIA request. Relevant to Scott's activities 1968-1971."
          },
          {
            "title": "Detroit Coalition Against Police Brutality records",
            "type": "organizational",
            "repository": "Unknown",
            "url": null,
            "notes": "Scott served as longtime spokesperson. Records may document activities and community reach."
          }
        ]
      }
    },
    {
      "id": "baker_gordon",
      "name": "General Gordon Baker Jr.",
      "type": "real",
      "meta_badman": false,
      "modality": "revolutionary",
      "years": {
        "birth": 1941,
        "death": 2014,
        "active_start": 1965,
        "active_end": 2014
      },
      "emergence": {
        "year": 1965,
        "context": "Wrote open letter refusing Vietnam draft, declaring willingness to fight for Black liberation on 12th Street but not in Vietnam. Organized September 10th Movement protest. This was two years before Muhammad Ali's famous refusal.",
        "source": {
          "title": "Letter to the Local Draft Board (1965)",
          "url": "https://viewpointmag.com/2015/06/30/letter-to-the-local-draft-board-1965/"
        }
      },
      "scores": {
        "outlaw_relationship": {
          "score": 5,
          "justification": "Publicly refused Vietnam draft in 1965, two years before Muhammad Ali. Organized wildcat strikes outside union authorization. Founded revolutionary organizations explicitly opposed to capitalist state. Arrested during 1967 Detroit rebellion."
        },
        "community_authorization": {
          "score": 4,
          "justification": "Led 4,000 workers in wildcat strikes. Founded DRUM and League of Revolutionary Black Workers with broad worker support. However, authorization came primarily from workers rather than broader Black community, and LRBW eventually split over strategic disagreements."
        },
        "violence_as_language": {
          "score": 3,
          "justification": "Rhetoric was militant and confrontational. Draft refusal letter declared willingness to fight for Black liberation. However, primary tactics were labor organizing and political education rather than armed resistance."
        },
        "cultural_preservation": {
          "score": 5,
          "justification": "Preserved and transmitted Marxist-Black nationalist synthesis through decades of organizing and education. Co-founded UHURU student organization. Maintained revolutionary theory through League of Revolutionaries for a New America. His papers are preserved at Wayne State's Reuther Library."
        },
        "hypermasculine_performance": {
          "score": 2,
          "justification": "Leadership style emphasized collective organizing and ideological discipline over individual masculine dominance. Revolutionary identity derived from intellectual and organizational capacity rather than physical confrontation or personal bravado."
        }
      },
      "influence": {
        "scale": "1-10",
        "metric_type": "curated_scholarly_estimate",
        "_REVIEW_NEEDED": "HARRY — these are placeholder estimates. Review and revise all values.",
        "phases": [
          {
            "start": 1965,
            "end": 1969,
            "value": 6,
            "justification": "PLACEHOLDER — Draft refusal letter circulated in activist networks. Co-founded UHURU at Wayne State. Arrested during 1967 rebellion. Building toward DRUM but not yet nationally visible.",
            "source": "TBD — Reuther Library archives"
          },
          {
            "start": 1968,
            "end": 1973,
            "value": 8,
            "justification": "PLACEHOLDER — Peak influence. Led 4,000-worker wildcat strike at Dodge Main. Founded DRUM and co-founded League of Revolutionary Black Workers. Featured in 'Finally Got the News' documentary (1970). National attention from labor and radical press.",
            "source": "Geschwender, Detroit: I Do Mind Dying; Finally Got the News (1970)"
          },
          {
            "start": 1974,
            "end": 1999,
            "value": 4,
            "justification": "PLACEHOLDER — LRBW split diminished organizational influence. Baker continued organizing through League of Revolutionaries for a New America but lower public profile. Influence sustained through mentorship and political education networks.",
            "source": "TBD — needs archival verification"
          },
          {
            "start": 2000,
            "end": 2025,
            "value": 5,
            "justification": "PLACEHOLDER — Renewed interest in DRUM through academic scholarship and documentary projects. 2010 U.S. Social Forum panel. Papers donated to Reuther Library after 2014 death. Legacy growing in labor history circles.",
            "source": "Reuther Library; U.S. Social Forum records"
          }
        ]
      },
      "biography": {
        "description": "General Gordon Baker Jr.—'General' was his given name—was born in Detroit to parents who had migrated from Georgia seeking auto industry work. After graduating from Southwestern High School at 16, Baker studied Marx at Wayne State University and co-founded UHURU, an African-American student organization, in 1963. He traveled to Cuba in 1964 to study the Castro government. In 1965, Baker wrote an open letter refusing the Vietnam draft, declaring 'when the call is made to FREE 12TH STREET HERE IN DETROIT, when these calls are made, send for me, for these shall be Historical Struggles in which it shall be an honor to serve!' This was two years before Muhammad Ali's famous refusal. After working at Chrysler's Dodge Main plant, Baker led 4,000 workers in a wildcat strike on May 2, 1968, founding the Dodge Revolutionary Union Movement (DRUM). DRUM spawned the League of Revolutionary Black Workers in 1969, combining Black Power politics with labor organizing at the point of production. Baker remained a revolutionary organizer until his death on May 18, 2014.",
        "key_events": [
          {
            "year": 1958,
            "event": "Graduated from Southwestern High School at age 16",
            "location": "Detroit, MI"
          },
          {
            "year": 1963,
            "event": "Co-founded UHURU student organization at Wayne State University",
            "location": "Detroit, MI"
          },
          {
            "year": 1964,
            "event": "Traveled to Cuba to study Castro government",
            "location": "Cuba"
          },
          {
            "year": 1965,
            "event": "Wrote open letter refusing Vietnam draft, organized September 10th Movement protest",
            "location": "Detroit, MI"
          },
          {
            "year": 1967,
            "event": "Arrested on first day of Detroit rebellion, July 23",
            "location": "Detroit, MI"
          },
          {
            "year": 1968,
            "event": "Led wildcat strike of 4,000 workers at Dodge Main plant, founded DRUM",
            "location": "Hamtramck, MI"
          },
          {
            "year": 1968,
            "event": "Led second wildcat strike July 8, shutting down plant for two days",
            "location": "Hamtramck, MI"
          },
          {
            "year": 1969,
            "event": "Co-founded League of Revolutionary Black Workers",
            "location": "Detroit, MI"
          },
          {
            "year": 2014,
            "event": "Died May 18, memorial held at UAW Local 600",
            "location": "Detroit, MI"
          }
        ]
      },
      "geographic": {
        "primary_location": {
          "name": "Dodge Main Plant",
          "coordinates": {
            "lat": 42.3954,
            "lng": -83.0569
          }
        },
        "territory": {
          "description": "Baker's territory centered on Detroit's auto plants, particularly Chrysler's Dodge Main in Hamtramck where DRUM was founded. His organizing extended throughout the auto industry across Detroit, including Ford's River Rouge plant and Chrysler's Eldon Avenue facility. Wayne State University, where he studied and founded UHURU, represented another key node. The 12th Street corridor, which he referenced in his draft refusal letter, became the epicenter of the 1967 rebellion.",
          "polygon": [
            [
              42.41,
              -83.1
            ],
            [
              42.41,
              -83.03
            ],
            [
              42.33,
              -83.03
            ],
            [
              42.33,
              -83.1
            ]
          ]
        },
        "additional_locations": [
          {
            "name": "Wayne State University",
            "coordinates": {
              "lat": 42.3574,
              "lng": -83.0693
            },
            "significance": "Where Baker studied Marx and co-founded UHURU student organization in 1963"
          },
          {
            "name": "12th Street corridor",
            "coordinates": {
              "lat": 42.3664,
              "lng": -83.0984
            },
            "significance": "Referenced in 1965 draft refusal letter; epicenter of 1967 Detroit rebellion where Baker was arrested"
          },
          {
            "name": "Ford River Rouge Plant",
            "coordinates": {
              "lat": 42.2989,
              "lng": -83.1497
            },
            "significance": "Site of DRUM-inspired organizing expansion"
          },
          {
            "name": "Eldon Avenue Chrysler Plant",
            "coordinates": {
              "lat": 42.4089,
              "lng": -83.0461
            },
            "significance": "Site of ELRUM (Eldon Avenue Revolutionary Union Movement) organizing"
          }
        ]
      },
      "connections": [],
      "sources": {
        "primary": [
          {
            "title": "Letter to the Local Draft Board (1965)",
            "type": "letter",
            "year": 1965,
            "url": "https://viewpointmag.com/2015/06/30/letter-to-the-local-draft-board-1965/"
          },
          {
            "title": "Finally Got the News",
            "type": "documentary",
            "year": 1970,
            "url": "https://www.imdb.com/title/tt0068588/"
          }
        ],
        "secondary": [
          {
            "title": "Detroit: I Do Mind Dying",
            "type": "academic",
            "year": 1975,
            "url": "https://www.haymarketbooks.org/books/436-detroit-i-do-mind-dying"
          },
          {
            "title": "General Gordon Baker, Jr.: A Detroit Revolutionary to the Core",
            "type": "institutional",
            "year": 2014,
            "url": "https://reuther.wayne.edu/node/12263"
          }
        ],
        "archival": [
          {
            "title": "Detroit Revolutionary Movements Records",
            "type": "organizational",
            "repository": "Walter P. Reuther Library, Wayne State University",
            "url": "https://archives.wayne.edu/repositories/2/resources/1425",
            "notes": "Primary collection for DRUM, LRBW, and related organizations. Includes correspondence, meeting minutes, publications, photographs. Essential for influence trajectory data."
          },
          {
            "title": "General Baker Papers",
            "type": "personal",
            "repository": "Walter P. Reuther Library, Wayne State University",
            "url": null,
            "notes": "Personal papers donated after Baker's death. May contain additional documentation of organizing activities and strike participation numbers."
          }
        ]
      }
    }
  ]
}
